HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxOvc_reg.h
/** \\brief  58, Redirected Address Base Register */
#define OVC1_BLK6_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB58u)

/** Alias (User Manual Name) for OVC1_BLK6_RABR.
* To use register names with standard convension, please use OVC1_BLK6_RABR.
*/
#define	OVC1_RABR6	(OVC1_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC1_BLK7_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB6Cu)

/** Alias (User Manual Name) for OVC1_BLK7_OMASK.
* To use register names with standard convension, please use OVC1_BLK7_OMASK.
*/
#define	OVC1_OMASK7	(OVC1_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC1_BLK7_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB68u)

/** Alias (User Manual Name) for OVC1_BLK7_OTAR.
* To use register names with standard convension, please use OVC1_BLK7_OTAR.
*/
#define	OVC1_OTAR7	(OVC1_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC1_BLK7_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB64u)

/** Alias (User Manual Name) for OVC1_BLK7_RABR.
* To use register names with standard convension, please use OVC1_BLK7_RABR.
*/
#define	OVC1_RABR7	(OVC1_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC1_BLK8_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB78u)

/** Alias (User Manual Name) for OVC1_BLK8_OMASK.
* To use register names with standard convension, please use OVC1_BLK8_OMASK.
*/
#define	OVC1_OMASK8	(OVC1_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC1_BLK8_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB74u)

/** Alias (User Manual Name) for OVC1_BLK8_OTAR.
* To use register names with standard convension, please use OVC1_BLK8_OTAR.
*/
#define	OVC1_OTAR8	(OVC1_BLK8_OTAR)

/** \\brief  70, Redirected Address Base Register */
#define OVC1_BLK8_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB70u)

/** Alias (User Manual Name) for OVC1_BLK8_RABR.
* To use register names with standard convension, please use OVC1_BLK8_RABR.
*/
#define	OVC1_RABR8	(OVC1_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC1_BLK9_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB84u)

/** Alias (User Manual Name) for OVC1_BLK9_OMASK.
* To use register names with standard convension, please use OVC1_BLK9_OMASK.
*/
#define	OVC1_OMASK9	(OVC1_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC1_BLK9_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB80u)

/** Alias (User Manual Name) for OVC1_BLK9_OTAR.
* To use register names with standard convension, please use OVC1_BLK9_OTAR.
*/
#define	OVC1_OTAR9	(OVC1_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC1_BLK9_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB7Cu)

/** Alias (User Manual Name) for OVC1_BLK9_RABR.
* To use register names with standard convension, please use OVC1_BLK9_RABR.
*/
#define	OVC1_RABR9	(OVC1_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC1_OSEL /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL*)0xF882FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXOVC_REG_H */
